```
 8:37AM: ~/repos/docnet/infra-configs/config/env0/environments/m3test [resolve-drift|✚1⚑3] tfw:[default]  k8s:[main] > tfp

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # env0_environment.nothing will be created
  + resource "env0_environment" "nothing" {
      + approve_plan_automatically       = true
      + auto_deploy_on_path_changes_only = true
      + deploy_on_push                   = true
      + deployment_id                    = (known after apply)
      + force_destroy                    = true
      + id                               = (known after apply)
      + name                             = "m3test-nothing-test"
      + project_id                       = "acec4df8-387a-455b-bf90-3360bfb13472"
      + revision                         = (known after apply)
      + run_plan_on_pull_requests        = true
      + template_id                      = "953c2453-a526-4043-a1a2-dc156d544371"
      + workspace                        = "m3test"

      + configuration {
          + name  = "a"
          + type  = "terraform"
          + value = "avalue"
        }
      + configuration {
          + name  = "b"
          + type  = "terraform"
          + value = "bvalue"
        }
      + configuration {
          + name  = "c"
          + type  = "terraform"
          + value = "cvalue"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run
"terraform apply" now.
 8:37AM: ~/repos/docnet/infra-configs/config/env0/environments/m3test [resolve-drift|✚1⚑3] tfw:[default]  k8s:[main] > tfa

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # env0_environment.nothing will be created
  + resource "env0_environment" "nothing" {
      + approve_plan_automatically       = true
      + auto_deploy_on_path_changes_only = true
      + deploy_on_push                   = true
      + deployment_id                    = (known after apply)
      + force_destroy                    = true
      + id                               = (known after apply)
      + name                             = "m3test-nothing-test"
      + project_id                       = "acec4df8-387a-455b-bf90-3360bfb13472"
      + revision                         = (known after apply)
      + run_plan_on_pull_requests        = true
      + template_id                      = "953c2453-a526-4043-a1a2-dc156d544371"
      + workspace                        = "m3test"

      + configuration {
          + name  = "a"
          + type  = "terraform"
          + value = "avalue"
        }
      + configuration {
          + name  = "b"
          + type  = "terraform"
          + value = "bvalue"
        }
      + configuration {
          + name  = "c"
          + type  = "terraform"
          + value = "cvalue"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

env0_environment.nothing: Creating...
env0_environment.nothing: Creation complete after 5s [id=bcd9ddd9-38be-4dec-8bbc-2b25242a460f]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
 8:37AM: ~/repos/docnet/infra-configs/config/env0/environments/m3test [resolve-drift|✚1⚑3] tfw:[default]  k8s:[main] > tfp
env0_environment.nothing: Refreshing state... [id=bcd9ddd9-38be-4dec-8bbc-2b25242a460f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # env0_environment.nothing has changed
  ~ resource "env0_environment" "nothing" {
        id                               = "bcd9ddd9-38be-4dec-8bbc-2b25242a460f"
        name                             = "m3test-nothing-test"
        # (10 unchanged attributes hidden)

      ~ configuration {
            name         = "a"
          + schema_enum  = []
            # (4 unchanged attributes hidden)
        }
      ~ configuration {
            name         = "b"
          + schema_enum  = []
            # (4 unchanged attributes hidden)
        }
      ~ configuration {
            name         = "c"
          + schema_enum  = []
            # (4 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following
plan may include actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  ~ update in-place

Terraform will perform the following actions:

  # env0_environment.nothing will be updated in-place
  ~ resource "env0_environment" "nothing" {
        id                               = "bcd9ddd9-38be-4dec-8bbc-2b25242a460f"
        name                             = "m3test-nothing-test"
        # (10 unchanged attributes hidden)

      ~ configuration {
            name         = "a"
          - schema_type  = "string" -> null
            # (4 unchanged attributes hidden)
        }
      ~ configuration {
            name         = "b"
          - schema_type  = "string" -> null
            # (4 unchanged attributes hidden)
        }
      ~ configuration {
            name         = "c"
          - schema_type  = "string" -> null
            # (4 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run
"terraform apply" now.
 8:38AM: ~/repos/docnet/infra-configs/config/env0/environments/m3test [resolve-drift|✚1⚑3] tfw:[default]  k8s:[main] > 
```

If you would like to get on a video call I can show you what I am talking about.  The real problem here is that if I use a dynamic block for the configuration to apply and then immediately run a plan, it wants to change all of the configuration.  This is due to the order in which the provider returns those configuration items.
